Revit 2026 API

# EnergyDataSettingsCreateAnalyticalModel Property

---

If this is true, data, features, and geometry related to the Energy Analytical Model will be created, allowing the energy performance to be analyzed through GreenBuilidingXML.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CreateAnalyticalModel { get; }
```
```vb
Public ReadOnly Property CreateAnalyticalModel As Boolean
	Get
```
```cpp
public:
property bool CreateAnalyticalModel {
	bool get ();
}
```
```fsharp
member CreateAnalyticalModel : bool with get
```

#### Property Value

Boolean

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace